from aiogram.utils.emoji import emojize

clear_history_text = (
    "Схоже що ти користувався попередньою версією бота, "
    "це чудово. Але щоб забезпечити зручне спілкування зі мною, "
    "пропоную очистити історію та почати все з чистого листа."
)
update_info_text = (
    "Привіт)\n"
    f"Зустрічай оновлену версію бота{emojize(':innocent:')} "
    "Тепер вона стала ще зручнішою для використання.\n"
    "Отож, нічого серйозного, розклад пар як і завжди в тебе під руками, "
    f"твоя задача їх відвідувати{emojize(':joy:')}{emojize(':sweat_smile:')}"
)
